In [38]:
import pandas as pd

In [39]:
data = {'first': ['Victor', 'Denis', 'Cleber'],
            'last':  ['Fonseca', 'Denison', 'Piquense'],
            'grad':  ['Physics', 'Electrical Engineering', 'Business']}

students = pd.DataFrame(data)
students

    first      last                    grad
0  Victor   Fonseca                 Physics
1   Denis   Denison  Electrical Engineering
2  Cleber  Piquense                Business

Renaming columns

In [40]:
students.rename(columns={'first':'First Name'})

  First Name      last                    grad
0     Victor   Fonseca                 Physics
1      Denis   Denison  Electrical Engineering
2     Cleber  Piquense                Business

In [41]:
students.rename(index={0:'a', 1:'b', 2:'c'}, inplace = True)
students

    first      last                    grad
a  Victor   Fonseca                 Physics
b   Denis   Denison  Electrical Engineering
c  Cleber  Piquense                Business

In [42]:
students.reset_index(inplace = True)
students

  index   first      last                    grad
0     a  Victor   Fonseca                 Physics
1     b   Denis   Denison  Electrical Engineering
2     c  Cleber  Piquense                Business

Dropping columns

In [43]:
students.drop(columns='index', inplace= True)

In [44]:
students

    first      last                    grad
0  Victor   Fonseca                 Physics
1   Denis   Denison  Electrical Engineering
2  Cleber  Piquense                Business

In [45]:
# students.drop(index = 0)

Setting columns type

In [47]:
students.first

<bound method NDFrame.first of     first      last                    grad
0  Victor   Fonseca                 Physics
1   Denis   Denison  Electrical Engineering
2  Cleber  Piquense                Business>